<?php

return [
    'required' => ':attribute-এর ঘরটি পূরণ করা আবশ্যক।',
    'email' => 'দয়া করে একটি সঠিক ইমেল ঠিকানা প্রদান করুন।',
    'string' => ':attribute অবশ্যই একটি শব্দ বা বাক্য হতে হবে।',
    'max' => [
        'string' => ':attribute অবশ্যই :max অক্ষরের কম হতে হবে।',
    ],
    'unique' => ':attribute ইতিমধ্যে ব্যবহৃত হয়েছে।',
    
    'custom' => [
        'whatsapp' => [
            'required' => 'আপনার সক্রিয় হোয়াটসঅ্যাপ নম্বরটি প্রদান করুন যেন ম্যাম আপনার সাথে যোগাযোগ করতে পারেন।',
        ],
        'transaction_id' => [
            'required' => 'পেমেন্ট নিশ্চিত করতে ট্রানজেকশন আইডিটি প্রদান করা বাধ্যতামূলক।',
        ],
    ],

    'attributes' => [
        'full_name' => 'নাম',
        'email' => 'ইমেইল',
        'whatsapp' => 'হোয়াটসঅ্যাপ নম্বর',
        'service_type' => 'সেবার ধরণ',
        'transaction_id' => 'ট্রানজেকশন আইডি',
        'message' => 'বার্তা',
    ],
];
